<?php

/* @var $this yii\web\View */

$this->title = 'Test Opora';
?>
<div class="site-index">

    <div class="container">
        <div class="row">
            <div class="col-sm-12">
                <h2>Пара моментов о которых хотелось бы написать</h2>

                1. В минимальных требованиях были след указания:
                <blockquote>
                    1) Сгенерировать посты от 10 до 50 шт. В качестве тела поста допустим Lorem Ipsum<br/>
                    2) Имитировать рандомное приращение просмотров каждые 5 минут
                </blockquote>
                <p>
                    Реализовал их через фикстуры - поэтому, чтобы что-то выводилось, нужно запустить команду <code>yii fixtures</code>
                </p>
                <p>
                    2. Наверное стоит Вам сказать, что Yii2, я не просто забыл, а, видимо, скорее совсем не знал.
                    Поэтому провозился с тривиальной задачей целый день и осталось много моментов, которые точно можно сделать покрасивее.
                    И не дошёл до секции "Будет плюсом"..
                </p>
                <p>
                    3. Благодарю Вас за время, которое Вы уделили на ревью моего тестового задания.
                </p>
            </div>
        </div>
    </div>
</div>
